[
    {
        "title": "At least 20 shot, 1 fatally, on Route 83 near Honeysuckle Rose Lane in Willowbrook Shooting: Tri-State Fire Protection District - WLS-TV",
        "url": "https://abc7chicago.com/willowbrook-shooting-route-83-honeysuckle-rose-lane-news/13397571/",
        "author": null,
        "content": "WATCH LIVE Unincorp. Willowbrook shooting suspect not yet publicly ID'd The man killed in an unincorporated Willowbrook, IL shooting near Honeysuckle Rose Lane and Route 83 Sunday has been identified. DuPAGE COUNTY, Ill. (WLS) -- The man killed in a shooting that left 22 others injured early Sunday morning near southwest suburban Willowbrook has been identified. Reginald Meadows, 31, of Willowbrook died from a gunshot wound to the abdomen, the DuPage County Coroner's Office said Monday morning. He was among 23 shot in a strip mall parking lot that remained blocked off to customers Monday morning. Investigators described the incident as a \"peaceful Juneteenth gathering Saturday, turned violent.\" Cellphone video shows the moments after gunfire unleashed on the parking lot, near Route 83 and Honeysuckle Rose Lane in unincorporated Willowbrook. People can be seen running and ducking for cover. RELATED: Chicago shooting: Teen girl among 5 shot near Lincoln Park Zoo, police say \"Last year, me and my kids were here, and it was nice. They were residents, a bunch of families out, they had a DJ, and it was a good time celebrating Juneteenth in the neighborhood. But for some reason this year, just really got out of hand,\" neighbor Jenilynn Humble said. \"I came out earlier in the night, and it felt a little rowdy, it felt off. So I ended up going in the house about 15 minutes later. I heard a lot of gunshots going off, scary.\" DuPage County sheriff's deputies said they were monitoring the Juneteenth gathering Saturday that began about 6 p.m. They were called away briefly for a 911 call, when deputies heard the gunshots and immediately returned. Victims were taken to multiple hospitals in DuPage, Cook and Will counties. Their ages were still unknown Monday. DuPage County officials did not immediately share any information about who might be responsible for the shooting. They are still in the process of interviewing witnesses and reviewing surveillance video. In a news release Monday, the sheriff's office said detectives are working to find additional witnesses and victims who may not have sought medical attention for their injuries. President Joe Biden \"has been tracking\" the incident, White House press secretary Karine Jean-Pierre said Monday. She said the White House had \"reached out to state and local officials to offer any federal assistance needed.\" \"It's devastating,\" she said. \"It's tragic. This type of gun violence needs to stop, and the president is going to continue to use his bully pulpit to speak to that. He's going to continue to do everything that he can.\" Truck carrying corrosive material rolls over on I-90 ramp: police What's open, what's closed on Juneteenth 5 shot, 2 killed in South Side shooting during family gathering: CPD"
    },
    {
        "title": "Biden strikes economic populist tone during campaign rally before exuberant union members - The Associated Press",
        "url": "https://apnews.com/article/president-joe-biden-unions-democrats-presidential-campaign-8242bafc4e61ed88f7f211c621132102",
        "author": "Seung Min Kim",
        "content": " PHILADELPHIA (AP) — President Joe Biden delivered an unapologetically economic populist message Saturday during the first rally of his reelection campaign, telling an exuberant crowd of union members that his policies had created jobs and lifted the middle class. Now, he said, is the time for the wealthy to “pay their fair share” in taxes. Biden spotlighted the sweeping climate, tax and health care package signed into law last year that cut the cost of prescription drugs and lowered insurance premiums — pocketbook issues that advisers say will be the centerpiece of his argument for a second term. “I’m looking forward to this campaign,” Biden said to cries of “four more years!” before adding, “We’ve got a record to run on.”  His choice of Philadelphia and Pennsylvania — and a friendly union audience — as his first official campaign stop reflected their crucial role in his reelection effort. The city was the site of his 2020 campaign headquarters and the state was one of a handful that had voted for Republican Donald Trump in 2016 but flipped back to Democrats four years later. Until the rally, Biden’s primary reelection campaign activity had been fundraising as the campaign tries to amass an impressive fundraising haul before the year’s second quarter concludes at the end of the month. The president raised money at a private home in Greenwich, Connecticut, on Friday and soon will hold fundraisers in California, Maryland, Illinois and New York. More than 1,000 union workers representing professions from carpenters and airport service workers to entertainers and heavy service equipment engineers — most wearing T-shirts bearing their union’s logos — began chanting “Let’s go, Joe!” and “We want Joe” and blowing whistles hours before the president arrived.  Biden did not mention any of his potential Republican opponents by name, but said many in the GOP “oppose everything I’ve done.” Pointing to high inflation rates, Republicans have criticized “Biden-omics” a term the president tried to turn back his opponents on Saturday.  “I don’t know what the hell that is,” he said, “but it’s working.” The event, which organizers said included unions representing 18 million workers nationwide, recalled then-candidate Biden opening his 2020 presidential campaign at a union hall in Pittsburgh.  Several of the nation’s most powerful unions — including the AFL-CIO, American Federation of Teachers and the American Federation of State, County and Municipal Employees — officially endorsed Biden’s campaign on Friday. The first-of-its-kind joint endorsement among the unions, and the backdrop of hundreds of workers are part of a meticulously choreographed effort to show the support of labor behind what Biden himself calls the most pro-union president in history.  The union endorsements followed Wednesday’s joint endorsement from major environmental groups, a back-to-back backing by design, according to a campaign official, meant to demonstrate that tackling climate change through green jobs does not threaten workers’ rights. Biden claimed in his remarks that if Wall Street bankers went on strike, no one would notice. But if unions members walked off the job, “the whole country would come to a grinding halt.” He also criticized those worth more than $1 billion for paying, he said, as little as 8% in federal taxes. That prompted a man in the audience to shout, “What do you pay?” to which Biden responded, “I pay a hell of a lot more than that.” He said repeatedly that the wealthy must “pay their fair share.” Before addressing the union gathering, Biden took a helicopter tour over the collapsed section of Interstate 95 in Philadelphia that has complicated traffic along one of the nation’s most crowded highways.  Michael Smith, a 62-year-old retired electrician and is a member of the International Brotherhood of Electrical Workers, said he liked Biden’s chances next year because of his administration’s championing green jobs and construction. Jennifer McKinnon, 53, a grade school librarian and member of the National Education Association, said she felt that Biden had a personal commitment to education because his wife, Jill, was a teacher who continued to teach English at a Northern Virginia community college as first lady. Jill Biden, an NEA member, addressed the union rally, too. “I fear that the Republicans are going to get caught in their cycle that they did last time and people aren’t going to buy it this time, so Joe’s going to sweep right in,” McKinnon said of the 2024 election, alluding to Trump, the early front-runner for the Republican presidential nomination.  Biden said his economic policies can lift all Americans regardless of economic status, an argument that could help him counter the kind of economic populism that buoyed Trump with some rank-and-file union members during his first two presidential campaigns. Clark Hamilton, a 63-year-old retiree and International Brotherhood of Electrical Workers member, said Biden embraced union values but also noted that the president sometimes “plays it like most politicians, in the middle.” He referenced Biden’s urging Congress to helped prevent a rail strike last year, which the president said could cripple commerce nationwide.  “That’s a shame,” Hamilton said. “But he was trying to save the economy.” Still, Hamilton said he’s confident that Biden’s record will secure him a second term next year “especially if it’s against Trump.”"
    },
    {
        "title": "Live: Ukraine 'destroyed ammunition depot' in Russian-occupied Kherson - FRANCE 24 English",
        "url": "https://www.france24.com/en/europe/20230618-%F0%9F%94%B4live-ukraine-says-destroyed-significant-ammunition-depot-in-russian-occupied-kherson",
        "author": "FRANCE 24",
        "content": "You don't have permission to access the page you requested. What is this page?The website you are visiting is protected.For security reasons this page cannot be displayed."
    },
    {
        "title": "Mali’s military rulers hold constitutional referendum vote - Al Jazeera English",
        "url": "https://www.aljazeera.com/news/2023/6/18/malis-military-rulers-hold-constitutional-referendum-vote",
        "author": "Al Jazeera",
        "content": "The military rulers vow a return to civilian rule, but opponents argue the changes would give president excessive power. Votes are being counted in Mali from a referendum on changing the constitution that the military rulers and regional powers have said will pave the way to elections and a return to civilian rule. The military government, which seized power in coups in 2020 and 2021, promised to hold the plebiscite as part of a transition to democracy under pressure from the Economic Community of West African States (ECOWAS). Voting on Sunday began at 08:00 GMT and provisional results are expected within 72 hours. Presidential elections are scheduled for February 2024. Voter turnout was projected to be low in the country of 21 million due to armed conflict. But it will be seen as an indicator of the military administration’s ability to restore stability and generate popular enthusiasm for its agenda. “I am convinced this referendum will pave the way for a new Mali, a strong Mali, an efficient Mali, a Mali in the service of the wellbeing of its population,” interim President Assimi Goita said on Sunday. Al Jazeera’s Nicolas Haque said that although around 8 million Malians are eligible to vote, “many of them will not be able to cast their ballots because there are large swathes of land in the north in the centre of the country that are in the hands of armed groups linked to al-Qaeda and ISIL [ISIS]”. Reporting from the capital, Bamako, Haque said that in the northern city of Kidal, there is no vote taking place, and in Timbuktu, armed groups have threatened to attack polling stations. However, he added that in Bamako, there is “an element of defiance” and a palpable sense that “Malians really want to get their voices heard and really want to push forward in this referendum and this change in the constitution”.     \n    Some of the changes in the committee-drafted constitution are contentious, with proponents saying they would strengthen fragile political institutions and opponents insisting they would give the president sweeping powers. But regional bodies and the United Nations see the referendum as a crucial test of the military’s willingness to stick to the transition and hold a nationwide democratic process, particularly when violent religious groups are stepping up attacks. Al Jazeera’s Haque said this was a moment 30 years in the making, adding that “the leader of the Malian military government has succeeded where previously elected presidents have failed in organising this vote and organising conversation around this referendum”. The vote, he said, is about creating “legitimacy and sovereignty for millions that have felt torn with violence in a country that’s been under attack for almost 10 years”. The draft includes updates that have been proposed in the past failed efforts to revise the constitution that supporters hope will reinforce democracy and address divisions, including the creation of a second parliamentary chamber to boost representation from across Mali. The proposed establishment of a separate court of auditors for state spending will bring Mali in line with a directive from the West African Economic and Monetary Union – also known by its French-language acronym UEMOA – from 2000. But some opposition parties, pro-democracy groups and campaigners for the “no” vote say the non-democratically elected authorities, such as the military, have no right to oversee such a substantial constitutional overhaul. “The concerns of the Muslim faith aren’t taken into account at all, that’s why I voted ‘no’,” 30-year-old Mariam Diop told the AFP news agency. But civil servant Boulan Barro said: “Today is a historic day. This vote will change many things … That’s why I voted ‘yes’, for a new Mali.” On Friday, the West African nation called on the United Nations to withdraw its peacekeeping mission from the country “without delay”, denouncing the UN’s “failure” to respond to security challenges. UN Security Council members must adopt a resolution to extend the mission’s mandate by June 30. The military rulers have increasingly imposed operational restrictions on peacekeepers and also broke Mali’s longstanding alliance with former colonial power France. The UN Multidimensional Integrated Stabilization Mission in Mali – MINUSMA, as the force is known – was set up in 2013 to help stabilise the country after a Tuareg rebellion the previous year that gave rise to continued fighting. While rebels were forced from power in Mali’s northern cities with the help of a French-led military operation, they regrouped in the desert and began launching attacks on the Malian army and its allies.     \n             Follow Al Jazeera English:"
    },
    {
        "title": "Meghan Markle appears downcast in first sighting since Spotify split - New York Post ",
        "url": "https://nypost.com/2023/06/18/meghan-markle-appears-downcast-in-first-sighting-since-spotify-split/",
        "author": "Katherine Donlevy",
        "content": "\nSubmit \n\n\n Δ \n\t\tThanks for contacting us. We've received your submission.\t Meghan Markle was spotted looking downcast Friday, the day after Spotify axed its $20 million podcast deal with her and her royal hubby. The Duchess of Sussex, 41, was seen strolling into a salon appointment in Santa Barbara and appeared to be partaking in an intense conversation, according to the Daily Mail. Markle removed her earbuds as she walked alongside her security officer and repeatedly glanced down at her phone. The grim-looking royal opted for no make-up and casual dress for her appointment, pairing black ballet flats, black skinny jeans, a striped sweater and a wristful of gold bracelets with a $5,400 Fendi Peekaboo ISeeU bag. She shed her nearly $200 sweater for a black long-sleeved T-shirt for her return to her Montecito home. Markle’s husband Prince Harry and their two children were not seen. The couple released a joint statement with Spotify Thursday announcing that their podcast “Archetypes” would not be renewed for a second season. While the platform and the couple’s company Archewell Audio stated they ” mutually agreed to part ways,” insiders claim the Duke and Duchess were dropped because they didn’t produce enough content to receive the full payout of the roughly $20 million deal the couple signed in 2020. The show hosted by Markle — which explored the labels that hold women back — was the only project the couple produced for Spotify during their two-and-a-half-year partnership. There were only 12 episodes of “Archetypes,” each of which typically ran about an hour. The day after the split, head of Spotify’s global sports strategy Bill Simmons expressed frustration over Harry and Markle, calling them “lazy” and “f–king grifters.” “I wish I had been involved in the ‘Megan and Harry leave Spotify’ negotiation,” Simmons said in a Friday episode of “The Bill Simmons Podcast.” “That’s a podcast we should’ve launched with them. I gotta get drunk one night and tell the story of this Zoom I had with Harry to try to help him with a podcast idea. It’s one of my best stories.” Royal experts slammed the podcast cancellation as a “shocking failure” and an indication that Harry and Markle’s empire is on the brink of ruin. “People are fed up with them now,” Prince Harry biographer Angela Levin said, adding that the couple’s forthcoming content plans will be “disastrous.”"
    },
    {
        "title": "Antony Blinken visits Beijing on a mission to mend fractured US-China ties - Financial Times",
        "url": "https://www.ft.com/content/749da706-9eaf-4a74-880b-dcc62f436dc9",
        "author": "Demetri Sevastopulo, Joe Leahy",
        "content": "\n\t\t\t\tJournalists in 50+ countries explore developments in global commerce from every perspective.\n\t\t\t\tFor Premium subscribers, we offer our dedicated ‘FT Free Trade’ newsletter every Tuesday and Thursday.\n\t\t\t \n Then TRY990 per month  New customers only  Cancel anytime during your trial \n During your trial you will have complete digital access to FT.com with everything in both of our Standard Digital and Premium Digital packages. Standard Digital includes access to a wealth of global news, analysis and expert opinion.  Premium Digital includes access to our premier business column, Lex, as well as 15 curated newsletters covering key business themes with original, in-depth reporting.  For a full comparison of Standard and Premium Digital, click here. Change the plan you will roll onto at any time during your trial by visiting the “Settings & Account” section. If you do nothing, you will be auto-enrolled in our premium digital monthly subscription plan and retain complete access for TRY990 per month. For cost savings, you can change your plan at any time online in the “Settings & Account” section. If you’d like to retain your premium access and save 20%, you can opt to pay annually at the end of the trial. You may also opt to downgrade to Standard Digital, a robust journalistic offering that fulfils many user’s needs. Compare Standard and Premium Digital here. Any changes made can be done at any time and will become effective at the end of the trial period, allowing you to retain full access for 4 weeks, even if you downgrade or cancel. You may change or cancel your subscription or trial at any time online. Simply log into Settings & Account and select \"Cancel\" on the right-hand side. You can still enjoy your subscription until the end of your current billing period. We support credit card, debit card and PayPal payments. Find the plan that suits you best. Premium access for businesses and educational institutions. Check if your\n\t\t\t\t\t\t\t\nuniversity\n or\n\t\t\t\t\t\t\t\norganisation\n offers FT membership to read for free.\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\tWe use\n\t\t\t\t\t\t\t\tcookies\n\t\t\t\t\t\t\t\tand other data for a number of reasons, such as keeping FT Sites reliable and secure,\n\t\t\t\t\t\t\t\tpersonalising content and ads, providing social media features and to\n\t\t\t\t\t\t\t\tanalyse how our Sites are used.\n\t\t\t\t\t\t\t International Edition"
    },
    {
        "title": "Russia-Ukraine war news: Kyiv continues counteroffensive; Blinken visits China - The Washington Post",
        "url": "https://www.washingtonpost.com/world/2023/06/18/russia-ukraine-war-news/",
        "author": "Niha Masih, Jennifer Hassan",
        "content": "Ukrainian fighters driving Kyiv’s counteroffensive operations are making “small advances” in several areas, including the Zaporizhzhia and Donetsk regions and around Bakhmut, Britain’s Defense Ministry said Sunday, noting that both sides are experiencing high casualties. Secretary of State Antony Blinken arrived in Beijing on Sunday for two days of high-stakes meetings. Here’s the latest on the war and its ripple effects across the globe. Russia aims to defeat counteroffensive with mines, artillery and aviation: The initial days of Ukraine’s counteroffensive may have yielded minor gains, but Russia has used the past seven months, Mary Ilyushina reports, to shore up its reserves and ammunition and gather more drones. Its forces have fortified the 900-mile front line, stretching from Zaporizhzhia in Ukraine’s southeast to Russia’s Belgorod region, just over the border. While Russia’s defense has weaknesses, military experts said, it is likely to slow down and impede Ukraine’s plans. “They’ve had months to create a defensive plan, they’ve dug in and used the terrain, they’ve been sitting there for six months laying little traps and mines,” said Dara Massicot, an expert on the Russian military at Rand Corp. “They feel as confident as they are probably going to feel that they understand their defensive lines.”"
    },
    {
        "title": "Pumping groundwater has caused the Earth's rotation to shift - study - The Jerusalem Post",
        "url": "https://www.jpost.com/science/article-746689",
        "author": "By  JUDY SIEGEL-ITZKOVICH",
        "content": "By pumping water out of the ground and moving it elsewhere, humans have actually shifted such a large mass of water that the Earth tilted nearly 80 centimeters east between 1993 and 2010 alone, changing the planet’s rotational pole, according to a new study published in the American Geophysical Union’s Geophysical Research Letters. Sea level rise is one of the most significant phenomena associated with the warming climate. Contemporary sea level rise has been monitored extensively by multiple observational techniques. The research was entitled “Drift of the Earth’s pole confirms groundwater depletion as a significant contributor to global sea level rise 1993-2010.”  Based on climate models, scientists previously estimated humans pumped 2,150 gigatons of groundwater, equivalent to more than six millimeters of sea level rise during this period – but validating that estimate has been difficult.One approach lies with the Earth’s rotational pole, which is the point around which the planet rotates. It moves during a process called polar motion, which is when the position of the Earth’s rotational pole varies relative to the crust. The distribution of water on the planet affects how mass is distributed. Like adding a tiny bit of weight to a spinning top, the Earth spins a little differently as water is moved around. Earth as seen from space. (credit: NASA)“Earth’s rotational pole actually changes a lot,” said Ki-Weon Seo, a geophysicist at Seoul National University who led the study. “Our study shows that among climate-related causes, the redistribution of groundwater actually has the largest impact on the drift of the rotational pole.”Water: Changing the Earth's rotationWater’s ability to change the Earth’s rotation was discovered in 2016, and until now, the specific contribution of groundwater to these rotational changes was unexplored. In the new study, researchers modeled the observed changes in the drift of Earth’s rotational pole and the movement of water – first, with only ice sheets and glaciers considered and then adding in different scenarios of groundwater redistribution. The model matched the observed polar drift only once the researchers included 2,150 gigatons of groundwater redistribution. Without it, the model was off by 78.5 centimeters or 4.3 centimeters of drift per year.“I’m very glad to find the unexplained cause of the rotation pole drift,” Seo said. “On the other hand, as a resident of Earth and a father, I’m concerned and surprised to see that pumping groundwater is another source of sea-level rise.”The location of the groundwater matters for how much it could change polar drift; redistributing water from the midlatitudes has a larger impact on the rotational pole. During the study period, the most water was redistributed in western North America and northwestern India, both at midlatitudes.Countries’ attempts to slow groundwater depletion rates, especially in those sensitive regions, could theoretically alter the change in drift, but only if such conservation approaches are sustained for decades, Seo said. The next step for this research could be looking to the past. “Observing changes in Earth’s rotational pole is useful for understanding continent-scale water storage variations,” Seo said. “Polar motion data are available from as early as the late 19th century. So, we can potentially use those data to understand continental water storage variations during the last century. Were there any hydrological regime changes resulting from the warming climate? Polar motion could hold the answer.”“This is a nice contribution and an important documentation for sure,” said Surendra Adhikari, a research scientist at the Jet Propulsion Laboratory who was not involved in this study. Adhikari published a 2016 paper on water redistribution impacting rotational drift. “They’ve quantified the role of groundwater pumping on polar motion, and it’s pretty significant.”The rotational pole normally changes by several meters within about a year, so changes due to groundwater pumping don’t run the risk of shifting seasons. But on geologic time scales, polar drift can have an impact on climate, Adhikari added.AGU (www.agu.org) is a global community supporting more than half a million advocates and professionals in Earth and space sciences. Through broad and inclusive partnerships, AGU aims to advance discovery and solution science that accelerate knowledge and create solutions that are ethical, unbiased and respectful of communities and their values.\r\n            \n\n Sea level rise is one of the most significant phenomena associated with the warming climate. Contemporary sea level rise has been monitored extensively by multiple observational techniques. The research was entitled “Drift of the Earth’s pole confirms groundwater depletion as a significant contributor to global sea level rise 1993-2010.”  Based on climate models, scientists previously estimated humans pumped 2,150 gigatons of groundwater, equivalent to more than six millimeters of sea level rise during this period – but validating that estimate has been difficult.One approach lies with the Earth’s rotational pole, which is the point around which the planet rotates. It moves during a process called polar motion, which is when the position of the Earth’s rotational pole varies relative to the crust. The distribution of water on the planet affects how mass is distributed. Like adding a tiny bit of weight to a spinning top, the Earth spins a little differently as water is moved around. Earth as seen from space. (credit: NASA)“Earth’s rotational pole actually changes a lot,” said Ki-Weon Seo, a geophysicist at Seoul National University who led the study. “Our study shows that among climate-related causes, the redistribution of groundwater actually has the largest impact on the drift of the rotational pole.”Water: Changing the Earth's rotationWater’s ability to change the Earth’s rotation was discovered in 2016, and until now, the specific contribution of groundwater to these rotational changes was unexplored. In the new study, researchers modeled the observed changes in the drift of Earth’s rotational pole and the movement of water – first, with only ice sheets and glaciers considered and then adding in different scenarios of groundwater redistribution. The model matched the observed polar drift only once the researchers included 2,150 gigatons of groundwater redistribution. Without it, the model was off by 78.5 centimeters or 4.3 centimeters of drift per year.“I’m very glad to find the unexplained cause of the rotation pole drift,” Seo said. “On the other hand, as a resident of Earth and a father, I’m concerned and surprised to see that pumping groundwater is another source of sea-level rise.”The location of the groundwater matters for how much it could change polar drift; redistributing water from the midlatitudes has a larger impact on the rotational pole. During the study period, the most water was redistributed in western North America and northwestern India, both at midlatitudes.Countries’ attempts to slow groundwater depletion rates, especially in those sensitive regions, could theoretically alter the change in drift, but only if such conservation approaches are sustained for decades, Seo said. The next step for this research could be looking to the past. “Observing changes in Earth’s rotational pole is useful for understanding continent-scale water storage variations,” Seo said. “Polar motion data are available from as early as the late 19th century. So, we can potentially use those data to understand continental water storage variations during the last century. Were there any hydrological regime changes resulting from the warming climate? Polar motion could hold the answer.”“This is a nice contribution and an important documentation for sure,” said Surendra Adhikari, a research scientist at the Jet Propulsion Laboratory who was not involved in this study. Adhikari published a 2016 paper on water redistribution impacting rotational drift. “They’ve quantified the role of groundwater pumping on polar motion, and it’s pretty significant.”The rotational pole normally changes by several meters within about a year, so changes due to groundwater pumping don’t run the risk of shifting seasons. But on geologic time scales, polar drift can have an impact on climate, Adhikari added.AGU (www.agu.org) is a global community supporting more than half a million advocates and professionals in Earth and space sciences. Through broad and inclusive partnerships, AGU aims to advance discovery and solution science that accelerate knowledge and create solutions that are ethical, unbiased and respectful of communities and their values.\r\n            \n\n The research was entitled “Drift of the Earth’s pole confirms groundwater depletion as a significant contributor to global sea level rise 1993-2010.”  Based on climate models, scientists previously estimated humans pumped 2,150 gigatons of groundwater, equivalent to more than six millimeters of sea level rise during this period – but validating that estimate has been difficult.One approach lies with the Earth’s rotational pole, which is the point around which the planet rotates. It moves during a process called polar motion, which is when the position of the Earth’s rotational pole varies relative to the crust. The distribution of water on the planet affects how mass is distributed. Like adding a tiny bit of weight to a spinning top, the Earth spins a little differently as water is moved around. Earth as seen from space. (credit: NASA)“Earth’s rotational pole actually changes a lot,” said Ki-Weon Seo, a geophysicist at Seoul National University who led the study. “Our study shows that among climate-related causes, the redistribution of groundwater actually has the largest impact on the drift of the rotational pole.”Water: Changing the Earth's rotationWater’s ability to change the Earth’s rotation was discovered in 2016, and until now, the specific contribution of groundwater to these rotational changes was unexplored. In the new study, researchers modeled the observed changes in the drift of Earth’s rotational pole and the movement of water – first, with only ice sheets and glaciers considered and then adding in different scenarios of groundwater redistribution. The model matched the observed polar drift only once the researchers included 2,150 gigatons of groundwater redistribution. Without it, the model was off by 78.5 centimeters or 4.3 centimeters of drift per year.“I’m very glad to find the unexplained cause of the rotation pole drift,” Seo said. “On the other hand, as a resident of Earth and a father, I’m concerned and surprised to see that pumping groundwater is another source of sea-level rise.”The location of the groundwater matters for how much it could change polar drift; redistributing water from the midlatitudes has a larger impact on the rotational pole. During the study period, the most water was redistributed in western North America and northwestern India, both at midlatitudes.Countries’ attempts to slow groundwater depletion rates, especially in those sensitive regions, could theoretically alter the change in drift, but only if such conservation approaches are sustained for decades, Seo said. The next step for this research could be looking to the past. “Observing changes in Earth’s rotational pole is useful for understanding continent-scale water storage variations,” Seo said. “Polar motion data are available from as early as the late 19th century. So, we can potentially use those data to understand continental water storage variations during the last century. Were there any hydrological regime changes resulting from the warming climate? Polar motion could hold the answer.”“This is a nice contribution and an important documentation for sure,” said Surendra Adhikari, a research scientist at the Jet Propulsion Laboratory who was not involved in this study. Adhikari published a 2016 paper on water redistribution impacting rotational drift. “They’ve quantified the role of groundwater pumping on polar motion, and it’s pretty significant.”The rotational pole normally changes by several meters within about a year, so changes due to groundwater pumping don’t run the risk of shifting seasons. But on geologic time scales, polar drift can have an impact on climate, Adhikari added.AGU (www.agu.org) is a global community supporting more than half a million advocates and professionals in Earth and space sciences. Through broad and inclusive partnerships, AGU aims to advance discovery and solution science that accelerate knowledge and create solutions that are ethical, unbiased and respectful of communities and their values.\r\n            \n\n Based on climate models, scientists previously estimated humans pumped 2,150 gigatons of groundwater, equivalent to more than six millimeters of sea level rise during this period – but validating that estimate has been difficult.One approach lies with the Earth’s rotational pole, which is the point around which the planet rotates. It moves during a process called polar motion, which is when the position of the Earth’s rotational pole varies relative to the crust. The distribution of water on the planet affects how mass is distributed. Like adding a tiny bit of weight to a spinning top, the Earth spins a little differently as water is moved around. Earth as seen from space. (credit: NASA)“Earth’s rotational pole actually changes a lot,” said Ki-Weon Seo, a geophysicist at Seoul National University who led the study. “Our study shows that among climate-related causes, the redistribution of groundwater actually has the largest impact on the drift of the rotational pole.”Water: Changing the Earth's rotationWater’s ability to change the Earth’s rotation was discovered in 2016, and until now, the specific contribution of groundwater to these rotational changes was unexplored. In the new study, researchers modeled the observed changes in the drift of Earth’s rotational pole and the movement of water – first, with only ice sheets and glaciers considered and then adding in different scenarios of groundwater redistribution. The model matched the observed polar drift only once the researchers included 2,150 gigatons of groundwater redistribution. Without it, the model was off by 78.5 centimeters or 4.3 centimeters of drift per year.“I’m very glad to find the unexplained cause of the rotation pole drift,” Seo said. “On the other hand, as a resident of Earth and a father, I’m concerned and surprised to see that pumping groundwater is another source of sea-level rise.”The location of the groundwater matters for how much it could change polar drift; redistributing water from the midlatitudes has a larger impact on the rotational pole. During the study period, the most water was redistributed in western North America and northwestern India, both at midlatitudes.Countries’ attempts to slow groundwater depletion rates, especially in those sensitive regions, could theoretically alter the change in drift, but only if such conservation approaches are sustained for decades, Seo said. The next step for this research could be looking to the past. “Observing changes in Earth’s rotational pole is useful for understanding continent-scale water storage variations,” Seo said. “Polar motion data are available from as early as the late 19th century. So, we can potentially use those data to understand continental water storage variations during the last century. Were there any hydrological regime changes resulting from the warming climate? Polar motion could hold the answer.”“This is a nice contribution and an important documentation for sure,” said Surendra Adhikari, a research scientist at the Jet Propulsion Laboratory who was not involved in this study. Adhikari published a 2016 paper on water redistribution impacting rotational drift. “They’ve quantified the role of groundwater pumping on polar motion, and it’s pretty significant.”The rotational pole normally changes by several meters within about a year, so changes due to groundwater pumping don’t run the risk of shifting seasons. But on geologic time scales, polar drift can have an impact on climate, Adhikari added.AGU (www.agu.org) is a global community supporting more than half a million advocates and professionals in Earth and space sciences. Through broad and inclusive partnerships, AGU aims to advance discovery and solution science that accelerate knowledge and create solutions that are ethical, unbiased and respectful of communities and their values.\r\n            \n\n One approach lies with the Earth’s rotational pole, which is the point around which the planet rotates. It moves during a process called polar motion, which is when the position of the Earth’s rotational pole varies relative to the crust. The distribution of water on the planet affects how mass is distributed. Like adding a tiny bit of weight to a spinning top, the Earth spins a little differently as water is moved around. Earth as seen from space. (credit: NASA)“Earth’s rotational pole actually changes a lot,” said Ki-Weon Seo, a geophysicist at Seoul National University who led the study. “Our study shows that among climate-related causes, the redistribution of groundwater actually has the largest impact on the drift of the rotational pole.”Water: Changing the Earth's rotationWater’s ability to change the Earth’s rotation was discovered in 2016, and until now, the specific contribution of groundwater to these rotational changes was unexplored. In the new study, researchers modeled the observed changes in the drift of Earth’s rotational pole and the movement of water – first, with only ice sheets and glaciers considered and then adding in different scenarios of groundwater redistribution. The model matched the observed polar drift only once the researchers included 2,150 gigatons of groundwater redistribution. Without it, the model was off by 78.5 centimeters or 4.3 centimeters of drift per year.“I’m very glad to find the unexplained cause of the rotation pole drift,” Seo said. “On the other hand, as a resident of Earth and a father, I’m concerned and surprised to see that pumping groundwater is another source of sea-level rise.”The location of the groundwater matters for how much it could change polar drift; redistributing water from the midlatitudes has a larger impact on the rotational pole. During the study period, the most water was redistributed in western North America and northwestern India, both at midlatitudes.Countries’ attempts to slow groundwater depletion rates, especially in those sensitive regions, could theoretically alter the change in drift, but only if such conservation approaches are sustained for decades, Seo said. The next step for this research could be looking to the past. “Observing changes in Earth’s rotational pole is useful for understanding continent-scale water storage variations,” Seo said. “Polar motion data are available from as early as the late 19th century. So, we can potentially use those data to understand continental water storage variations during the last century. Were there any hydrological regime changes resulting from the warming climate? Polar motion could hold the answer.”“This is a nice contribution and an important documentation for sure,” said Surendra Adhikari, a research scientist at the Jet Propulsion Laboratory who was not involved in this study. Adhikari published a 2016 paper on water redistribution impacting rotational drift. “They’ve quantified the role of groundwater pumping on polar motion, and it’s pretty significant.”The rotational pole normally changes by several meters within about a year, so changes due to groundwater pumping don’t run the risk of shifting seasons. But on geologic time scales, polar drift can have an impact on climate, Adhikari added.AGU (www.agu.org) is a global community supporting more than half a million advocates and professionals in Earth and space sciences. Through broad and inclusive partnerships, AGU aims to advance discovery and solution science that accelerate knowledge and create solutions that are ethical, unbiased and respectful of communities and their values.\r\n            \n\n “Earth’s rotational pole actually changes a lot,” said Ki-Weon Seo, a geophysicist at Seoul National University who led the study. “Our study shows that among climate-related causes, the redistribution of groundwater actually has the largest impact on the drift of the rotational pole.”Water: Changing the Earth's rotationWater’s ability to change the Earth’s rotation was discovered in 2016, and until now, the specific contribution of groundwater to these rotational changes was unexplored. In the new study, researchers modeled the observed changes in the drift of Earth’s rotational pole and the movement of water – first, with only ice sheets and glaciers considered and then adding in different scenarios of groundwater redistribution. The model matched the observed polar drift only once the researchers included 2,150 gigatons of groundwater redistribution. Without it, the model was off by 78.5 centimeters or 4.3 centimeters of drift per year.“I’m very glad to find the unexplained cause of the rotation pole drift,” Seo said. “On the other hand, as a resident of Earth and a father, I’m concerned and surprised to see that pumping groundwater is another source of sea-level rise.”The location of the groundwater matters for how much it could change polar drift; redistributing water from the midlatitudes has a larger impact on the rotational pole. During the study period, the most water was redistributed in western North America and northwestern India, both at midlatitudes.Countries’ attempts to slow groundwater depletion rates, especially in those sensitive regions, could theoretically alter the change in drift, but only if such conservation approaches are sustained for decades, Seo said. The next step for this research could be looking to the past. “Observing changes in Earth’s rotational pole is useful for understanding continent-scale water storage variations,” Seo said. “Polar motion data are available from as early as the late 19th century. So, we can potentially use those data to understand continental water storage variations during the last century. Were there any hydrological regime changes resulting from the warming climate? Polar motion could hold the answer.”“This is a nice contribution and an important documentation for sure,” said Surendra Adhikari, a research scientist at the Jet Propulsion Laboratory who was not involved in this study. Adhikari published a 2016 paper on water redistribution impacting rotational drift. “They’ve quantified the role of groundwater pumping on polar motion, and it’s pretty significant.”The rotational pole normally changes by several meters within about a year, so changes due to groundwater pumping don’t run the risk of shifting seasons. But on geologic time scales, polar drift can have an impact on climate, Adhikari added.AGU (www.agu.org) is a global community supporting more than half a million advocates and professionals in Earth and space sciences. Through broad and inclusive partnerships, AGU aims to advance discovery and solution science that accelerate knowledge and create solutions that are ethical, unbiased and respectful of communities and their values.\r\n            \n\n Water’s ability to change the Earth’s rotation was discovered in 2016, and until now, the specific contribution of groundwater to these rotational changes was unexplored. In the new study, researchers modeled the observed changes in the drift of Earth’s rotational pole and the movement of water – first, with only ice sheets and glaciers considered and then adding in different scenarios of groundwater redistribution. The model matched the observed polar drift only once the researchers included 2,150 gigatons of groundwater redistribution. Without it, the model was off by 78.5 centimeters or 4.3 centimeters of drift per year.“I’m very glad to find the unexplained cause of the rotation pole drift,” Seo said. “On the other hand, as a resident of Earth and a father, I’m concerned and surprised to see that pumping groundwater is another source of sea-level rise.”The location of the groundwater matters for how much it could change polar drift; redistributing water from the midlatitudes has a larger impact on the rotational pole. During the study period, the most water was redistributed in western North America and northwestern India, both at midlatitudes.Countries’ attempts to slow groundwater depletion rates, especially in those sensitive regions, could theoretically alter the change in drift, but only if such conservation approaches are sustained for decades, Seo said. The next step for this research could be looking to the past. “Observing changes in Earth’s rotational pole is useful for understanding continent-scale water storage variations,” Seo said. “Polar motion data are available from as early as the late 19th century. So, we can potentially use those data to understand continental water storage variations during the last century. Were there any hydrological regime changes resulting from the warming climate? Polar motion could hold the answer.”“This is a nice contribution and an important documentation for sure,” said Surendra Adhikari, a research scientist at the Jet Propulsion Laboratory who was not involved in this study. Adhikari published a 2016 paper on water redistribution impacting rotational drift. “They’ve quantified the role of groundwater pumping on polar motion, and it’s pretty significant.”The rotational pole normally changes by several meters within about a year, so changes due to groundwater pumping don’t run the risk of shifting seasons. But on geologic time scales, polar drift can have an impact on climate, Adhikari added.AGU (www.agu.org) is a global community supporting more than half a million advocates and professionals in Earth and space sciences. Through broad and inclusive partnerships, AGU aims to advance discovery and solution science that accelerate knowledge and create solutions that are ethical, unbiased and respectful of communities and their values.\r\n            \n\n The model matched the observed polar drift only once the researchers included 2,150 gigatons of groundwater redistribution. Without it, the model was off by 78.5 centimeters or 4.3 centimeters of drift per year.“I’m very glad to find the unexplained cause of the rotation pole drift,” Seo said. “On the other hand, as a resident of Earth and a father, I’m concerned and surprised to see that pumping groundwater is another source of sea-level rise.”The location of the groundwater matters for how much it could change polar drift; redistributing water from the midlatitudes has a larger impact on the rotational pole. During the study period, the most water was redistributed in western North America and northwestern India, both at midlatitudes.Countries’ attempts to slow groundwater depletion rates, especially in those sensitive regions, could theoretically alter the change in drift, but only if such conservation approaches are sustained for decades, Seo said. The next step for this research could be looking to the past. “Observing changes in Earth’s rotational pole is useful for understanding continent-scale water storage variations,” Seo said. “Polar motion data are available from as early as the late 19th century. So, we can potentially use those data to understand continental water storage variations during the last century. Were there any hydrological regime changes resulting from the warming climate? Polar motion could hold the answer.”“This is a nice contribution and an important documentation for sure,” said Surendra Adhikari, a research scientist at the Jet Propulsion Laboratory who was not involved in this study. Adhikari published a 2016 paper on water redistribution impacting rotational drift. “They’ve quantified the role of groundwater pumping on polar motion, and it’s pretty significant.”The rotational pole normally changes by several meters within about a year, so changes due to groundwater pumping don’t run the risk of shifting seasons. But on geologic time scales, polar drift can have an impact on climate, Adhikari added.AGU (www.agu.org) is a global community supporting more than half a million advocates and professionals in Earth and space sciences. Through broad and inclusive partnerships, AGU aims to advance discovery and solution science that accelerate knowledge and create solutions that are ethical, unbiased and respectful of communities and their values.\r\n            \n\n “I’m very glad to find the unexplained cause of the rotation pole drift,” Seo said. “On the other hand, as a resident of Earth and a father, I’m concerned and surprised to see that pumping groundwater is another source of sea-level rise.”The location of the groundwater matters for how much it could change polar drift; redistributing water from the midlatitudes has a larger impact on the rotational pole. During the study period, the most water was redistributed in western North America and northwestern India, both at midlatitudes.Countries’ attempts to slow groundwater depletion rates, especially in those sensitive regions, could theoretically alter the change in drift, but only if such conservation approaches are sustained for decades, Seo said. The next step for this research could be looking to the past. “Observing changes in Earth’s rotational pole is useful for understanding continent-scale water storage variations,” Seo said. “Polar motion data are available from as early as the late 19th century. So, we can potentially use those data to understand continental water storage variations during the last century. Were there any hydrological regime changes resulting from the warming climate? Polar motion could hold the answer.”“This is a nice contribution and an important documentation for sure,” said Surendra Adhikari, a research scientist at the Jet Propulsion Laboratory who was not involved in this study. Adhikari published a 2016 paper on water redistribution impacting rotational drift. “They’ve quantified the role of groundwater pumping on polar motion, and it’s pretty significant.”The rotational pole normally changes by several meters within about a year, so changes due to groundwater pumping don’t run the risk of shifting seasons. But on geologic time scales, polar drift can have an impact on climate, Adhikari added.AGU (www.agu.org) is a global community supporting more than half a million advocates and professionals in Earth and space sciences. Through broad and inclusive partnerships, AGU aims to advance discovery and solution science that accelerate knowledge and create solutions that are ethical, unbiased and respectful of communities and their values.\r\n            \n\n The location of the groundwater matters for how much it could change polar drift; redistributing water from the midlatitudes has a larger impact on the rotational pole. During the study period, the most water was redistributed in western North America and northwestern India, both at midlatitudes.Countries’ attempts to slow groundwater depletion rates, especially in those sensitive regions, could theoretically alter the change in drift, but only if such conservation approaches are sustained for decades, Seo said. The next step for this research could be looking to the past. “Observing changes in Earth’s rotational pole is useful for understanding continent-scale water storage variations,” Seo said. “Polar motion data are available from as early as the late 19th century. So, we can potentially use those data to understand continental water storage variations during the last century. Were there any hydrological regime changes resulting from the warming climate? Polar motion could hold the answer.”“This is a nice contribution and an important documentation for sure,” said Surendra Adhikari, a research scientist at the Jet Propulsion Laboratory who was not involved in this study. Adhikari published a 2016 paper on water redistribution impacting rotational drift. “They’ve quantified the role of groundwater pumping on polar motion, and it’s pretty significant.”The rotational pole normally changes by several meters within about a year, so changes due to groundwater pumping don’t run the risk of shifting seasons. But on geologic time scales, polar drift can have an impact on climate, Adhikari added.AGU (www.agu.org) is a global community supporting more than half a million advocates and professionals in Earth and space sciences. Through broad and inclusive partnerships, AGU aims to advance discovery and solution science that accelerate knowledge and create solutions that are ethical, unbiased and respectful of communities and their values.\r\n            \n\n Countries’ attempts to slow groundwater depletion rates, especially in those sensitive regions, could theoretically alter the change in drift, but only if such conservation approaches are sustained for decades, Seo said. The next step for this research could be looking to the past. “Observing changes in Earth’s rotational pole is useful for understanding continent-scale water storage variations,” Seo said. “Polar motion data are available from as early as the late 19th century. So, we can potentially use those data to understand continental water storage variations during the last century. Were there any hydrological regime changes resulting from the warming climate? Polar motion could hold the answer.”“This is a nice contribution and an important documentation for sure,” said Surendra Adhikari, a research scientist at the Jet Propulsion Laboratory who was not involved in this study. Adhikari published a 2016 paper on water redistribution impacting rotational drift. “They’ve quantified the role of groundwater pumping on polar motion, and it’s pretty significant.”The rotational pole normally changes by several meters within about a year, so changes due to groundwater pumping don’t run the risk of shifting seasons. But on geologic time scales, polar drift can have an impact on climate, Adhikari added.AGU (www.agu.org) is a global community supporting more than half a million advocates and professionals in Earth and space sciences. Through broad and inclusive partnerships, AGU aims to advance discovery and solution science that accelerate knowledge and create solutions that are ethical, unbiased and respectful of communities and their values.\r\n            \n\n The next step for this research could be looking to the past. “Observing changes in Earth’s rotational pole is useful for understanding continent-scale water storage variations,” Seo said. “Polar motion data are available from as early as the late 19th century. So, we can potentially use those data to understand continental water storage variations during the last century. Were there any hydrological regime changes resulting from the warming climate? Polar motion could hold the answer.”“This is a nice contribution and an important documentation for sure,” said Surendra Adhikari, a research scientist at the Jet Propulsion Laboratory who was not involved in this study. Adhikari published a 2016 paper on water redistribution impacting rotational drift. “They’ve quantified the role of groundwater pumping on polar motion, and it’s pretty significant.”The rotational pole normally changes by several meters within about a year, so changes due to groundwater pumping don’t run the risk of shifting seasons. But on geologic time scales, polar drift can have an impact on climate, Adhikari added.AGU (www.agu.org) is a global community supporting more than half a million advocates and professionals in Earth and space sciences. Through broad and inclusive partnerships, AGU aims to advance discovery and solution science that accelerate knowledge and create solutions that are ethical, unbiased and respectful of communities and their values.\r\n            \n\n “This is a nice contribution and an important documentation for sure,” said Surendra Adhikari, a research scientist at the Jet Propulsion Laboratory who was not involved in this study. Adhikari published a 2016 paper on water redistribution impacting rotational drift. “They’ve quantified the role of groundwater pumping on polar motion, and it’s pretty significant.”The rotational pole normally changes by several meters within about a year, so changes due to groundwater pumping don’t run the risk of shifting seasons. But on geologic time scales, polar drift can have an impact on climate, Adhikari added.AGU (www.agu.org) is a global community supporting more than half a million advocates and professionals in Earth and space sciences. Through broad and inclusive partnerships, AGU aims to advance discovery and solution science that accelerate knowledge and create solutions that are ethical, unbiased and respectful of communities and their values.\r\n            \n\n The rotational pole normally changes by several meters within about a year, so changes due to groundwater pumping don’t run the risk of shifting seasons. But on geologic time scales, polar drift can have an impact on climate, Adhikari added.AGU (www.agu.org) is a global community supporting more than half a million advocates and professionals in Earth and space sciences. Through broad and inclusive partnerships, AGU aims to advance discovery and solution science that accelerate knowledge and create solutions that are ethical, unbiased and respectful of communities and their values.\r\n            \n\n AGU (www.agu.org) is a global community supporting more than half a million advocates and professionals in Earth and space sciences. Through broad and inclusive partnerships, AGU aims to advance discovery and solution science that accelerate knowledge and create solutions that are ethical, unbiased and respectful of communities and their values.\r\n            \n\n "
    },
    {
        "title": "After escaping the Taliban, hundreds of Afghans languish in Albania in a prolonged US visa process - The Associated Press",
        "url": "https://apnews.com/article/albania-afghans-us-visa-process-wait-9d10f8cd031ac8150727a2ac433d7689",
        "author": "Llazar Semini",
        "content": " SHENGJIN, Albania (AP) — Almost two years since he fled Afghanistan to escape the Taliban takeover, Firooz Mashoof is still haunted by the memory of his last day in Kabul — the bus that took him to the airport, getting on a packed plane and taking off as gunfire echoed across the city.  “The last thing I saw were the mountains around Kabul and the dreary sunset as the Qatar Airways took off,” he said.  Today, thousands of miles from his homeland, the 35-year-old photojournalist and former employee of the Afghan soccer federation, is languishing in warm and sunny Albania. With each passing day, his anxiety grows over the delay in the promised U.S. visa, casting a shadow on his dreams of a new beginning in America.  For hundreds of others like him, it’s an emotional roller coaster. Some try to find work and live with a semblance of normalcy but the concern and fear for families back home permeates their days — even in welcoming Albania.  They are hopeful, despite the prolonged bureaucracy, and look to a new life.  In Shengjin, a town on the Adriatic coast some 70 kilometers (45 miles) northwest of the Albanian capital of Tirana where hundreds of Afghans were given temporary shelter, Mashoof often goes for long walks by the sea. He has found work at a mall, an hour’s bus ride away.  The walks stave off panic attacks that he has been forgotten — or the “crazy fear” for his family back in western Herat province. “I was saved, ... and now I am to start my new life in America,” he said, “But when?”  The Taliban seized power in Afghanistan in August 2021 as U.S. and NATO troops were in the final weeks of their withdrawal from the country after two decades of war and as the U.S.-backed Afghan government and military crumbled. Despite initial promises of a more moderate rule, they soon started to enforce restrictions on women and girls, barring them from public spaces and most jobs, and banning education for girls beyond the sixth grade.  The measures harked back to the previous Taliban rule of Afghanistan in the late 1990s, when they also imposed their strict interpretation of Islamic law, or Sharia. The harsh edicts prompted an international outcry against the already ostracized Taliban, whose administration has not been officially recognized by the United Nations or the international community.  As the Taliban pursued an ever more hard-line path, a severe economic downturn followed, despite efforts by aid agencies to help large swaths of the impoverished nation.  In the days of the chaotic pullout, Washington had decided to take in all those who had worked for the U.S. government and American troops or for U.S.-based media organizations and nongovernmental groups in Afghanistan. But over time, the complicated visa process for Afghans who demonstrate they are at risk of persecution became protracted.  More than 3,200 Afghans have stayed in Albania’s tourist resorts along the Adriatic Sea. A NATO member, Albania first agreed to house fleeing Afghans for one year before they move for final settlement in the United States, then pledged to keep them for longer if their visas were delayed.  There are about 76,000 Afghans already in the U.S., where congressional efforts meant to permanently resolve their immigration status have also stalled.  A top Albanian government official told The Associated Press that the authorities in Tirana would not be against keeping Afghans more long-term in the Balkan country, if they can find jobs. The official did not elaborate and spoke on condition of anonymity to discuss the subject.  Last year, a small group of Afghans in Shengjin staged a protest, calling on Washington to speed up the process of their transfer. Some women and children held posters reading, “We are forgotten.” “I don’t have the heart to protest because of the delay,” Mashoof said. “There is nothing I can do.” Fazil Mohammad Shahab, a senior soccer federation official in Afghanistan, came to Albania in November 2021. Unlike many of the thousands of tourists who visit Shengjin and other Albanian resorts, he doesn’t see the pristine coastline as an unspoiled paradise.  “For me, it’s a place of waiting,” he said. On a sunny day earlier this month in Shengjin, Afghan women holding scarves clustered in small groups as their children played on the grass. Afghan couples walked along the beach or sat at a nearby café. Farishta Oustovar, a television news reporter and a former player on Afghanistan’s national volleyball team, arrived in Albania in September 2021. Within two months she found work — first at a hotel, then at a shoe factory and finally at a childcare center. “I need to feel that I can have a normal life,” said the 23-year-old, despite worries for her family in Herat.  A popular TV presenter and comedian, 30-year-old Qasim Taban resumed producing funny YouTube clips from Shengjin. He says he finds strength in humor and is hopeful friends and fans back home can see the videos. “We, here in Albania, and also Afghans back in Afghanistan need to laugh,” he said.  ___ Follow Llazar Semini at https://twitter.com/lsemini"
    },
    {
        "title": "Wyndham Clark lashes out at USGA for U.S. Open 'twilight golf' - SB Nation",
        "url": "https://www.sbnation.com/golf/2023/6/18/23764994/us-open-wyndham-clark-lashes-out-usga-twilight-golf-rickie-fowler",
        "author": "Kendall Capps",
        "content": "We use cookies and other tracking technologies to improve your browsing experience on our site, show personalized content and targeted ads, analyze site traffic, and understand where our audiences come from. To learn more or opt-out, read our Cookie Policy. Please also read our Privacy Notice and Terms of Use, which became effective December 20, 2019. By choosing I Accept, you consent to our use of cookies and other tracking technologies. Filed under: Wyndham Clark was not happy with the tee times on Saturday at the U.S. Open and did not pull any punches after his round. As we enter the final round of the 2023 U.S. Open, the leaderboard is chalk full of big names. Rory McIlroy will play alongside Scottie Scheffler in the penultimate pairing Sunday. They will come before Rickie Fowler and the surprise of the tournament, Wyndham Clark. Clark, after posting his third straight round in the 60s at the Los Angeles Country Club, met with media to discuss his round. Despite being pleased with how he played Saturday, he couldn’t help but put the USGA on blast. “It’s a little ridiculous we teed off that late. I would say right around hole 15 or 16 it started getting to where you couldn’t see that well... We played twilight golf... I 100 percent think my bogey on 17 was because I couldn’t see, and I think Rickie’s bogey on 18 was because he couldn’t see,” Clark said visibly frustrated. Clark and Fowler were not slated to tee off until 3:45pm PT and did not finish until approximately 8pm PT. It sounds like he has a point as it was near dark outside when the interview occurred. “It definitely was a challenge. 17 and 18... I literally couldn’t see, and we just played off of feel and how Rickie’s putt came in, and then my putt on 18, same thing.” The first group did not tee off until just after noon on the east coast. They very easily could have moved those tee times up, eliminating this issue. “It’s crazy to think that we’re doing that on the last two holes of a major when we could have teed off two hours earlier. Hopefully tomorrow we don’t have that issue.” Tell us what you really think Wyndham. “Definitely Rickie and I had a little bit of a disadvantage on those last two holes playing in the dark... I’ve never really played a final round of any tournament in the dark.” Just in case you are wondering why Clark or Fowler didn’t call it, he addressed that also. “Honestly, we both could have called it if we wanted to on that putting green and said, hey, I can’t see, and we’d play tomorrow, and I think that would look pretty poorly on both sides of it.” Once again, he is right. That would have been a black eye for the USGA if they did not finish in time before darkness. Not when there were hours to play in the morning. But also, it could have created a perception among some fans that the golfers themselves were copping out. Interestingly, Wyndham Clark is not the only golfer to criticize the USGA this week. Brooks Koepka, Viktor Hovland and reigning U.S. Open champion Matt Fitzpatrick have all expressed displeasure, for one reason or another. Tee times have been released for Sunday and the USGA has indeed moved them up, just over an hour.  Clark and Fowler are slated to tee off at 2:30pm PT. They share the 54-hole lead at 10-under par. McIlroy is one shot back and Scheffler stalking three back. Buckle up, it should be a fun ride. "
    },
    {
        "title": "Can We Admit Mainstreaming Juneteenth Has Been a Disaster? - The Daily Beast",
        "url": "https://www.thedailybeast.com/can-we-admit-mainstreaming-juneteenth-has-been-a-disaster",
        "author": "Ernest Owens",
        "content": "SEARCH Nearly two years after being nationally recognized, the celebration of Black American emancipation has turned into a misguided holiday of performativity. On June 17, 2021, nearly a year after the murder of George Floyd, President Joe Biden thought it was a bright idea to make Juneteenth an official U.S. holiday—signing it into law, to be observed by all. “Making Juneteenth a federal holiday is a major step forward to recognize the wrongs of the past,” Senate Majority Leader Chuck Schumer (D-NY), said at the time, “but we must continue to work to ensure equal justice and fulfill the promise of the Emancipation Proclamation and our Constitution.” Sure, Chuck. Growing up in Houston, Juneteenth—an event that commemorates June 19, 1865, as the day enslaved Black people in Galveston, Texas, learned they were free (more than two years after the Emancipation Proclamation had been signed)—was a Black holiday in my hometown. I remember spending my summers down at Galveston Beach and watching the procession of decorated cars with live music proceed as the Jubilee parade commenced. I can still smell the tasty barbeque, remember the gallons of signature red soda passed around, and all that hot sauce doused on my plate as the red and blue Juneteenth flags were waved. Juneteenth was our Fourth of July—a celebration which reminded me that the South still had something to say, and that Black people didn’t have to wait for the validation of our white peers to gather around our history. Since the racial uprisings of 2020, this sacred holiday has now become mainstreamed into something that now feels whitewashed, co-opted, and highly performative. It’s hard to witness something so personal in your life become ruined on the national stage—that’s the current case with Juneteenth. I started to notice it last year when Walmart thought it was being progressive when they released a red velvet and cheesecake-flavored Juneteenth ice cream with a Pan-African decorated carton. Fun fact: Juneteenth has never incorporated African themed colors/designs as part of its official flag (organizers use red, white, and blue to replicate the U.S. and Texas state flags)—Walmart just couldn’t help but pander to customers as a way to flex that they were recognizing Black people. The controversy led to the corporation to apologize and discontinue the line of tone-deaf ice cream, along with canceling other ill-advised Juneteenth-themed merchandise it was selling. But it’s not just Walmart. Last year, the Children’s Museum of Indianapolis had to go into full-apology mode after attempting to incorporate a watermelon salad as a part of its “Juneteenth Jamboree” menu. This year, a cringy banner created by a Greensville, South Carolina, non-profit hosting a Juneteenth event made headlines for promoting “an upstate celebration of freedom, unity and love” that featured an image of a white couple. After public backlash from activists and community members, the organization, Juneteenth GVL Inc, issued an apology on social media. Even worse, with the rise of far-right conservatism throughout the country—it’s gotten even harder for groups to even celebrate Juneteenth in peace. Juneteenth organizers in Pittsburgh are now accusing Pennsylvania legislators and their city government of discrimination regarding last-minute mandates for vendors and security. In Tennessee, some legislators are threatening sponsors—such as Nashville International Airport (BNA)—to divest from backing local Juneteenth festivals or face public retaliation for supporting “radical agendas.” In so many ways, the desire to mainstream Juneteenth has now led to much of its press and publicity being met with pandering or controversy. It reminds me of Black History Month, when perhaps there was a moment in time in which America tried to take the shortest timeframe of the year seriously to acknowledge the contributions of Black people. Or perhaps Juneteenth has quickly descended into the rainbow capitalism vibes of Pride month—during which more of the festivities are being monetized for high visibility, without any intentional focus on the community. So, great, more people know about Juneteenth—but how does that actually ensure the very freedoms and concepts of emancipation for Black Americans that the holiday speaks of? For what it’s worth, symbolism will do nothing to liberate a marginalized group. At a time when racial disparities continue to worsen and white supremacy feels even more visibly prevalent—corporations and city/state governments bandwagoning on Juneteenth celebrations do very little to combat this reality. As with Black History Month, I would like to see these powerful institutions actually put their money/policies/influence where their mouths are and let Black people celebrate Juneteenth in peace. Seriously, there are some things that should just be left alone. Translation: Less means more when it comes to observing Juneteenth—because our nation’s current infatuation with it is causing more harm than good. Got a tip? Send it to The Daily Beast here."
    },
    {
        "title": "2023 Canadian Grand Prix qualifying report and highlights: Verstappen charges to pole for Canadian GP as Hulkenberg grabs surprise P2 before being hit with grid drop | Formula 1® - Formula 1",
        "url": "https://www.formula1.com/en/latest/article.verstappen-charges-to-pole-for-canadian-gp-as-hulkenberg-grabs-surprise-p2.snbFfMsKnoRZy2J7Rjxjr.html",
        "author": "F1",
        "content": "00 00 00 00  Sorry  Something's gone wrong    \n \n \n   Sorry  Something's gone wrong.  \nReport\n \n17 June 2023\n \n                \n    \n        News\n    \n\n                \n    \n\n             IN NUMBERS: The amazing stats behind Red Bullâs century of F1 wins \n                \n    \n        News\n    \n\n                \n    \n\n             Horner hails Red Bull's 'incredible achievement' after 'sensational' Verstappen seals team's 100th F1 victory in Montreal \n                \n    \n        News\n    \n\n                \n    \n\n             'It was more than I expected' â 'Super happy' Albon praises 'monumental' Williams upgrades after P7 finish in Canada \n                \n    \n        Feature\n    \n\n                \n    \n\n             6 Winners and 5 Losers from the Canadian Grand Prix â Who made all the right moves in Montreal? \n                \n    \n        News\n    \n\n                \n    \n\n             âItâs definitely encouragingâ says Leclerc of Ferrariâs Canadian GP turnaround as Sainz addresses team orders call Discover more news  Red Bull driver Max Verstappen took pole position for the Canadian Grand Prix as wet weather conditions dominated Saturdayâs qualifying session in Montreal, with Nico Hulkenberg a surprise second for Haas due to a well-timed effort, only to lose the position later in the evening for a red flag breach. Verstappen got down to a 1m 25.858s in the early stages of Q3 to put one hand on pole position in the tricky conditions, just before McLaren rookie Oscar Piastri brought out the red flags by rear-ending the wall at Turn 7. READ MORE: Verstappen praises Red Bull for making 'all the right calls' on his way to a storming pole position in Montreal Seconds from the session being halted, Hulkenberg delivered a lap good enough for a spot on the front row, with another deluge of rain during the break ensuring that no improvements could be made when the action resumed. However, the stewards announced post-session that they would be looking into a potential red flag violation from Hulkenberg and, following their review, the decision was made to give the German a three-place grid penalty. Fernando Alonso rounded out the top three positions for Aston Martin, with Mercedes pair Lewis Hamilton and George Russell taking fourth and fifth as they look to continue the teamâs upward trajectory â all three benefitting from Hulkenbergâs sanction. Esteban Ocon was sixth for Alpine and Lando Norris seventh for McLaren, while Carlos Sainz was the fastest of the Ferraris after team mate Charles Leclerc â along with Red Bullâs Sergio Perez and Aston Martinâs Lance Stroll â dropped out in a dry/wet Q2 phase. Sainz and Stroll also received penalties after the session, though, with the Spaniard found guilty of impeding Pierre Gasly at the end of Q1 and Stroll deemed to have held up Ocon in the following Q2 phase. Alex Albon used the changeable conditions in Q2 to his advantage, being the first to bolt on softs and rising to P1 before more rainfall arrived, and then completing the top 10 behind Piastri in the pole shootout. Leclerc and Perez had to settle for P11 and P12 on the grid respectively, having missed the cut when conditions were at their most precarious in Q2, leading to an angry radio message from the Monegasque when his fate was sealed. Stroll was another big name to miss out on Q3 after a scruffy session that included a wild spin, the home favourite ending up 13th from the other Haas machine of Kevin Magnussen and the lead Alfa Romeo of Valtteri Bottas. AlphaTauri lost both drivers in the opening Q1 phase, with Yuki Tsunoda in 16th and Nyck de Vries in 18th, as Gasly suffered a painful elimination in 17th after his moment with Sainz. Tsunoda was the third and final driver to be docked three places for impeding Hulkenberg. Logan Sargeant could not emulate Albonâs heroics as he piloted his upgrade-free Williams to 19th position, while Zhou Guanyu brought up the rear in the other Alfa Romeo after technical gremlins hindered his efforts. After a largely dry first day at the Circuit Gilles Villeneuve, the heavens opened and drenched the track as second practice drew to a close, setting the scene for what would be further wet and windy weather when the drivers returned for final practice and qualifying. A sodden FP3 behind them, which saw Verstappen lead the way and Sainz give his mechanics a significant pre-qualifying repair job by crashing out, the drivers queued up at the end of the pit lane on intermediates for the start of Q1 â puddles, spray and a general lack of grip being added to the usual challenges of the grid-deciding hour. Although the showers had eased, the track surface was extremely slippery as drivers geared up for their first runs, but before any laps could be posted Zhou lost drive, parked up at the side of the track and brought out the red flags, only to get going again afterward. When the action resumed, with a fresh wall of rain approaching on the weather radar, teams were quick to send their drivers back out â including Zhouâs rebooted car â to get some banker laps on the board, sending the timing screen into a frenzy of purple and green splits. Verstappen and Alonso got into a rhythm immediately to trade fastest times on several occasions, the Red Bull driver working his way down to a 1m 21.988s to sit half a tenth up on Alonso, as Leclerc ran wide at the Turn 8/9 chicane and Hamilton took a trip over the grass at Turn 3/4. With some five minutes on the clock, Verstappen was asked for his thoughts on swapping to a dry tyre, which he quickly dismissed. While the Dutchman continued on his initial set of intermediates, lowering the benchmark to a 1m 21.739s, several other drivers used this window to fit fresh ones. Another busy phase followed, kicked off by Alonso taking over in P1 on a 1m 21.583s, and improving again to a 1m 21.481s next time around, only for Verstappen to respond emphatically by clocking a 1m 20.851s â more than half a second clear. Hamilton slotted into third as the rest of the times came in, despite reporting trouble seeing out of his mirrors, followed by team mate Russell, the lead Ferrari of Leclerc, the high-flying, upgraded Williams of Albon, Norris and Ocon. Perez struggled to replicate Verstappenâs pace en route to ninth, more than a second off the pace in the sister Red Bull, as Piastri completed the top 10 positions from Sainz, Bottas and Magnussen, with Stroll and Hulkenberg the final drivers to make the Q2 cut. However, the stewards confirmed that they would be looking into Sainzâs driving post-session after Gasly encountered his car at the final chicane, took evasive action and furiously dropped out in 17th, slotting between the AlphaTauris of Yuki Tsunoda and Nyck de Vries, with Sargeant and Zhou at the back. Knocked out: Tsunoda, Gasly, De Vries, Sargeant and Zhou When drivers headed back out for the second qualifying segment, most selected intermediates to tackle their first timed runs. However, an ever-drying racing line, and an ongoing break in the weather, tempted Albon and Norris to go for slicks and act as the guinea pigs for the rest of the field. After Russell's early intermediate-shod 1m 20.098s, which put him a few hundredths clear of Verstappen, a host of drivers pitted to make the switch to soft tyres, but Stroll and Aston Martin initially stuck with the green-marked wet option thanks to a spin at Turn 6. Albon duly pumped in a 1m 18.725s on his soft tyres to jump to the top of the order just as more drops of rain began to fall, leaving the conditions on a knife-edge. With the shower then increasing in intensity, the Williams manâs tactics paid off and he remained in P1. Verstappen placed second, 0.367s away from Albon, followed by McLaren duo Norris and Piastri, Alonso, Sainz, Russell and Hulkenberg, with Ocon and Hamilton the last drivers to reach Q3 â Leclerc, Perez and Stroll all high-profile victims of the conditions. Leclerc and Perez were unable to get a quick enough lap in on the softs as they wound up 11th and 12th respectively â the Ferrari man shouting over the radio after the team resisted his call to pit for slicks sooner â while Stroll, Magnussen and Bottas also fell at the second hurdle. Knocked out: Leclerc, Perez, Stroll, Magnussen, Bottas With conditions continuing to dictate play, Verstappen headed another pack of cars out of the pit lane as Q3 began â all drivers taking up intermediates again after the brief appearance of the slicks and attempting to put a lap to their names. Verstappen was the first to do so, posting a 1m 27.059s and then lowering the target to a 1m 25.858s, as Alonso moved into second position and more rain began to hit the track, putting even greater pressure on the 10 men in play to hit the ground running. âItâs raining. Itâs just getting worse and worse,â was the message to Hulkenberg, who shot up the timing screen to P2 a matter of seconds before Piastri lost control of his car and slid rearwards into the wall at Turn 7, triggering a red flag. That would effectively stop the session there and then as, while the action resumed a few minutes later, more rain had returned and locked in the top 10 positions â Verstappen on pole, Hulkenberg a huge winner in second and Alonso taking third. Hamilton and Russell put their Mercedes machines fourth and fifth, followed by Ocon, Norris and Sainz, as Piastri â watching from the sidelines after his crash â and Albon rounded out the Q3 runners. However, Sainz, along with Tsunoda (for impeding Hulkenberg) and Stroll (for impeding Ocon), were hit with three-place grid penalties after qualifying, while Hulkenberg also took a three-place drop for a separate red flag violation â meaning he loses his front-row start. âYesterday wasnât fantastic, so we made a few changes to the car,â said pole-sitter Verstappen. âI do think the car improved to drive. It was super slippery out there, but we made all the right calls so, of course, Iâm very happy to be on pole here. Maybe itâs dry tomorrow, but we have a good race car.â The 2023 Canadian Grand Prix is set to begin at 1400 local time on Sunday. Head to the RACE HUB to find out how you can catch the action from the Circuit Gilles Villeneuve. \n                \n    \n        News\n    \n\n                \n    \n\n             âIâm kicking myselfâ â Russell apologises to Mercedes after Canada DNF \n                \n    \n        Video\n    \n\n                \n    \n\n             WATCH: Enjoy the race start at the 2023 Canadian Grand Prix as Hamilton claims P2 behind Verstappen \n                \n    \n        Feature\n    \n\n                \n    \n\n             What the teams said â Race day in Canada \n                \n    \n        News\n    \n\n                \n    \n\n             Hamilton buoyed by Canadian GP podium as he insists Mercedes are âgoing in the right directionâ News\n\t\t\t\t\t\t\n    \n\n\t\t\t\t\t Verstappen hails âincredibleâ milestone as he helps Red Bull hit a century of F1 wins Download the Official F1 App Â© 2003-2023 Formula One World Championship Limited"
    },
    {
        "title": "Horoscope for Sunday, June 18, 2023 - Chicago Sun-Times",
        "url": "https://chicago.suntimes.com/2023/6/18/23750456/horoscopes-today-sunday-june-18-2023",
        "author": "Georgia Nicols",
        "content": "After 6 a.m. Chicago time, there are no restrictions to shopping or important decisions. The moon is in Cancer. For those of you who want to putter around home and get things done, this will be a productive day. Discussions with an older family member, especially private discussions, might take place. You might also entertain at home because group gatherings are favored. You might learn something. This is certainly an excellent day to study or to make long-range practical plans. It’s also a great day for a short trip because you are particularly upbeat and optimistic. You will enjoy schmoozing with others and staying in touch with siblings and relatives. Business and commerce are favored. Financial negotiations and planning will have a solid outcome. You might also see ways to boost your income. Work-related travel might happen for some. On the whole, this is a fortunate day for you. Enjoy! The moon is in your sign dancing with both Saturn and Jupiter. This gives you a well-balanced approach between practical realism and hopeful optimism. Therefore, trust your decisions. Whatever you enter into will probably be successful. This is a lovely day to schmooze with friends and loved ones. Although you will enjoy the company of any gathering, you will also be happy to have a private, one-to-one encounter with someone. This will make you feel good. Incidentally, this is an excellent time for you to buy wardrobe treasures for yourself. A friend, especially someone older or more experienced, might have wise advice for you today. In fact, their advice might encourage you to change your goals, or a discussion with someone might suggest travel plans or exploring opportunities in publishing, medicine and the law. You are high visibility today! Some people seem to know personal details about your private life. This could be because an important discussion with a boss or someone in authority is taking place. Very likely, you will benefit financially or in practical terms. Keep your pockets open! This is the perfect day to make travel plans, or indeed to blow town if you can swing this. This could relate to your kids, especially regarding duties and obligations or something to do with your education. You might also travel with a partner or close friend for pleasure. This is a financially beneficial day for you. Negotiations will go your way. It’s a good day to ask for a loan or to request the use of something that someone else owns. If you settle disputes about inheritances and such, you’ll come out laughing all the way to the bank. This is a good day for a heart-to-heart discussion with a close friend, spouse or partner. You might want to discuss practical situations that need to be addressed, especially in the long-term future. However, you might also have some light-hearted, fun-loving playful times with kids or social outings. Your health and your job are both favored because you can see practical ways to improve each of these areas in your life. Real estate opportunities are worth checking out. This is a good day to entertain work colleagues at home. This is a playful day! Romance, fun activities with kids, social outings and sports events are all excellent choices. Basically, you want to have fun! You might also help someone younger to train, practice or hone their technique in the arts or sports. Alana de la Garza (1976) shares your birthday today. You are charming, playful, passionate and adventurous and you hate to be bored. You have an excellent head for business. Simplicity is the key to life this year. Take charge of your health. Create solid foundations. Explore physical exercise, or perhaps martial arts or yoga."
    },
    {
        "title": "Prograis tops Zorrilla, defends WBC junior welterweight title - ESPN - ESPN",
        "url": "https://www.espn.com/boxing/story/_/id/37871406/prograis-tops-zorrilla-defends-wbc-junior-welterweight-title",
        "author": "Andrew Lopez",
        "content": "NEW ORLEANS -- It wasn't the performance Regis Prograis wanted to put on in his hometown, but he was able to successfully defend his WBC junior welterweight title on Saturday night. Prograis defeated Danielito Zorrilla by split decision on Saturday night at the Smoothie King Center. Prograis won on two cards 118-109 and 117-110 while one scorecard went Zorrilla's way 114-113. Prograis (29-1, 25 KO) was honest about his performance and felt he could have put on a better show for the local crowd. \"My performance was s---. I can admit to myself it wasn't a good performance,\" Prograis said. \"The last two days, I felt the hometown jitters. The hometown fights, they are the worst. I felt it going into it yesterday into today. I got the job done. I kept the belt. I'm happy about that, but I'm definitely not happy about my performance.\" Zorrilla (17-2, 13 KO) took the fight on less than a month's notice as he was a late replacement for undefeated Australian fighter Liam Paro, who pulled out of the bout with an injury. Following the fight, Prograis sat with Matchroom boxing promoter Eddie Hearn as the two spoke with reporters about what options could be next at 140 pounds. Bill Haney, Devin Haney's father, was in attendance on Saturday but Hearn said there are plenty of options for Prograis' next fight. Hearn mentioned Haney, Teofimo Lopez and Gervonta Davis as all great fights that could be made for Prograis. \"For me, it's up to Regis,\" Hearn said. \"I mean, I think the great thing about tonight is there's going to be a lot of people queuing up to fight. I've not heard any of those big names mention Regis' name before tonight, other than Devin. But now I think you're going to see people actually target Regis Prograis that he might be beatable now. \"Which we know, there's a completely different performance to come from Regis Prograis. I think that's the one thing that I'm happy about and I believe Devin wants that fight.\" It was the first successful title defense of Prograis' career. After winning the WBA title at 140 pounds from Kiryl Relikh in 2019, Prograis dropped the belt in a majority decision to Josh Taylor later that year. It remains the only loss of his career. This time, Prograis defended his crown. In the third round, Prograis dropped Zorrilla with a left hand and started to build on that momentum the rest of the fight. However, that quickly went away as the two danced and plotted on each other for the remainder of the fight. \"He came to survive,\" Prograis said about Zorrilla. \"He didn't want to get knocked out. He came to survive. I was chasing him. I just had to chase him for 12 rounds.\" Prograis went to the mat three times but none were ruled knockdowns by referee Ray Corona. In the first round, Zorrilla stunned Prograis with a right knocking him off balance, and both men went to the ground as Prograis tried to clutch with Zorrilla falling into the champion. However, it was ruled as a push. In the 10th round, Prograis' fall was called a slip and then he again touched the mat in the 12th on a push. He admitted after the fight that he felt the first-round fall didn't feel like a knockdown in the moment but looking back at the replay, it could have been. This was the first major championship fight inside the Smoothie King Center since 2000 when undisputed light heavyweight champion Roy Jones Jr. defeated Eric Harding at what was then called New Orleans Arena (Derrick Gainer also defeated Freddie Norwood for the WBA featherweight title on the same card). It was the third card that Prograis has headlined in New Orleans. His previous two fights were at the Lakefront Arena on the campus of the University of New Orleans. New Orleans rap duo Fresh X Reckless performed during Prograis' walk as the 34-year-old put his own flair on the entrance with a 10-foot Rougarou -- Prograis' nickname and a werewolf-like monster from local folklore -- following him. However, because of those \"hometown jitters\" Prograis mentioned, there's a good chance his next fight won't be in the city. \"I don't think next time,\" Prograis said. \"We'll probably go on the road and then come back here down the line. But not next fight.\" Hearn said there are opportunities for Prograis that could be in Las Vegas or the Middle East for his next fight. The undercard featured a big upset as Ramla Ali lost her first professional fight as she was stopped in the fourth round against Julissa Alejandra Guzman. Guzman (13-2, 7 KO) dropped Ali early in the fifth round and finished things off in eighth with a counter left that caused Ali to buckle in the center of the ring. As Ali (8-1, 2 KO) attempted to get up, she stumbled and referee Keith Hughes waved it off giving Guzman the victory."
    },
    {
        "title": "The unexplained rise of cancer among millennials - Financial Times",
        "url": "https://www.ft.com/content/90d5f2e3-d539-4149-a503-2114ac3ef355",
        "author": "Amy Borrett, Sarah Neville",
        "content": "\n\t\t\t\tKeep abreast of significant corporate, financial and political developments around the world.\n\t\t\t\tStay informed and spot emerging risks and opportunities with independent global reporting, expert\n\t\t\t\tcommentary and analysis you can trust.\n\t\t\t \n Then TRY990 per month  New customers only  Cancel anytime during your trial \n During your trial you will have complete digital access to FT.com with everything in both of our Standard Digital and Premium Digital packages. Standard Digital includes access to a wealth of global news, analysis and expert opinion.  Premium Digital includes access to our premier business column, Lex, as well as 15 curated newsletters covering key business themes with original, in-depth reporting.  For a full comparison of Standard and Premium Digital, click here. Change the plan you will roll onto at any time during your trial by visiting the “Settings & Account” section. If you do nothing, you will be auto-enrolled in our premium digital monthly subscription plan and retain complete access for TRY990 per month. For cost savings, you can change your plan at any time online in the “Settings & Account” section. If you’d like to retain your premium access and save 20%, you can opt to pay annually at the end of the trial. You may also opt to downgrade to Standard Digital, a robust journalistic offering that fulfils many user’s needs. Compare Standard and Premium Digital here. Any changes made can be done at any time and will become effective at the end of the trial period, allowing you to retain full access for 4 weeks, even if you downgrade or cancel. You may change or cancel your subscription or trial at any time online. Simply log into Settings & Account and select \"Cancel\" on the right-hand side. You can still enjoy your subscription until the end of your current billing period. We support credit card, debit card and PayPal payments. Find the plan that suits you best. Premium access for businesses and educational institutions. Check if your\n\t\t\t\t\t\t\t\nuniversity\n or\n\t\t\t\t\t\t\t\norganisation\n offers FT membership to read for free.\n\t\t\t\t\t\t \n\t\t\t\t\t\t\t\tWe use\n\t\t\t\t\t\t\t\tcookies\n\t\t\t\t\t\t\t\tand other data for a number of reasons, such as keeping FT Sites reliable and secure,\n\t\t\t\t\t\t\t\tpersonalising content and ads, providing social media features and to\n\t\t\t\t\t\t\t\tanalyse how our Sites are used.\n\t\t\t\t\t\t\t International Edition"
    },
    {
        "title": "Breaking: Bob Huggins resigns as West Virginia coach in wake of arrest | SportsCenter - ESPN",
        "url": "https://www.youtube.com/watch?v=v0Z1pjBpZbo",
        "author": null,
        "content": ""
    },
    {
        "title": "Tesla discounts Model S/X $8000, plus 3 years of free Supercharging in end-of-quarter push - Electrek.co",
        "url": "https://electrek.co/2023/06/17/tesla-discounts-model-s-x-8000-3-years-of-free-supercharging/",
        "author": "Fred Lambert",
        "content": "Tesla has added a discount to the new inventory of Model S and Model X vehicles and three years of free Supercharging for deliveries by the end of the quarter. With the end of the quarter approaching, Tesla is looking to deliver better-looking financial results by not ending it with many vehicles in inventory. To achieve this, Tesla has regularly applied special discounts or incentives to take delivery of new inventory vehicles by the end of the quarter. We reported that Tesla recently offered three months of free Supercharging for people taking deliveries of a Model 3 by the end of June. Now Tesla is giving even bigger incentives on new inventory of Model S and Model X vehicles. After dropping the price of the new Model S and Model X significantly earlier this year, Tesla is now giving an extra discount of up to $8,000 on some vehicles. It results in brand-new Model S vehicles going for as low as $82,790 ($1,113 monthly for a lease or $1,307 loan payments). On top of that, Tesla is giving three years of free Supercharging for buyers who take delivery by June 30. That’s the incentive Tesla first used to get owners of older Model S to give up their free Supercharging for life by buying a new car – this later expanded to all new orders. The problem with the S and X is they are both wildly overpriced. I’ve had an S since 2016 and an X since 2019. Both are definitely superior to even the top of the line 3 and Y, but the 30,000 premium is not justified. Tesla needs to bring back the standard range Model S. That would be an awesome ~300 mile range car that would bridge the gap between the Long Range S and the Performance 3 and Y. This is the lowest the Model S has been in a long time, and with three years of free Supercharging, this is starting to be a very attractive deal. It’s not surprising that Tesla is leaning on more significant incentives, considering the fact that it looks like the automaker’s Model S inventory has more than doubled over the last three weeks: I’d be tempted to grab one of those if Tesla was giving me a good trade-in price for my Model 3 with FSD Beta, which it, unfortunately, does not. I won’t spam my referral code here, but if I helped you decide to buy a Tesla vehicle or product with my writing/podcast, you can reach out to me for a referral code at fred@electrek.co. Using a referral code results in both the referrer and new buyer getting Tesla credit points, which are redeemable for Cybertruck raffle entries, Tesla accessories, free Supercharging miles, and more. FTC: We use income earning auto affiliate links. More. Subscribe to Electrek on YouTube for exclusive videos and subscribe to the podcast. Tesla is a transportation and energy company. It… The Tesla Model S is an all-electric luxury seda… Fred is the Editor in Chief and Main Writer at Electrek. You can send tips on Twitter (DMs open) or via email: fred@9to5mac.com Through Zalkon.com, you can check out Fred’s portfolio and get monthly green stock investment ideas. \n\t\t\t\t\t\t\t\t\t\tGet interesting investment ideas by Fred Lambert\t\t\t\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\tChargePoint Home WiFi Enabled Electric Vehicle (EV) Charger\t\t\t\t\t\t\t\t\t"
    },
    {
        "title": "Bill Nye breaks down 'extraordinary discovery' found on moon of Saturn - CNN",
        "url": "https://www.youtube.com/watch?v=upVrWFs5Sxg",
        "author": null,
        "content": ""
    },
    {
        "title": "African leaders tell Putin war 'must end' during Ukraine peace talks - NBC News",
        "url": "https://www.youtube.com/watch?v=NOZODOnOqJ4",
        "author": null,
        "content": ""
    }
]